src/main/resources/request2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUserRequest2>
            <gs:email>janedoe@gmail.com</gs:email>
        </gs:getUserRequest2>
    </soapenv:Body>
</soapenv:Envelope>